# Pandas
Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language.

# DataFrame
In a DataFrame, the data is arranged in rows and columns much like a table. Similar to a two-dimensional array, it is a two-dimensional data structure.

## Creating a Pandas DataFrame Using Dictionary

In [38]:
import pandas as pd

# create a dictionary
data = {'Name': ['Virat', 'Rohit', 'Ramesh'],
       'Age': [35, 40, 45],
       'City': ['Punjab', 'Mumbai', 'Chandigarh']}

# create a dataframe from the dictionary
df = pd.DataFrame(data)


print(df)

     Name  Age        City
0   Virat   35      Punjab
1   Rohit   40      Mumbai
2  Ramesh   45  Chandigarh

## Creating a Pandas DataFrame Using Python List

In [39]:
import pandas as pd

# create a two-dimensional list
data = [['Virat', 35, 'Punjab'],
       ['Rohit', 40, 'Mumbai'],
       ['Ramesh', 45, 'Chandigarh']]

# create a DataFrame from the list
df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])


print(df)

     Name  Age        City
0   Virat   35      Punjab
1   Rohit   40      Mumbai
2  Ramesh   45  Chandigarh

## Creating a Pandas DataFrame From a File

In [56]:
import pandas as pd

# load data from a CSV file
df = pd.read_csv('sampledata.csv')

print(df)

     Name  Age        City
0   Virat   55      Punjab
1   Rohit   70      Mumbai
2  Ramesh   45  Chandigarh

## Pandas DataFrame Functions

### Head

In [41]:
# top 5 rows
df.head()

     Name  Age        City
0   Virat   55      Punjab
1   Rohit   70      Mumbai
2  Ramesh   45  Chandigarh

In [42]:
# top 2 rows
df.head(2)

    Name  Age    City
0  Virat   55  Punjab
1  Rohit   70  Mumbai

### Tail

In [43]:
# last 2 rows
df.tail(2)

     Name  Age        City
1   Rohit   70      Mumbai
2  Ramesh   45  Chandigarh

In [44]:
# last 5 rows
df.tail()

     Name  Age        City
0   Virat   55      Punjab
1   Rohit   70      Mumbai
2  Ramesh   45  Chandigarh

### Info

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 120.0+ bytes

### Shape

In [46]:
df.shape

(3, 3)

### Datatypes

In [47]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

### Describe

In [48]:
df.describe()

             Age
count   3.000000
mean   56.666667
std    12.583057
min    45.000000
25%    50.000000
50%    55.000000
75%    62.500000
max    70.000000

### Sorting

In [53]:
# in ascending order
df.sort_values("Age")

     Name  Age        City
2  Ramesh   45  Chandigarh
0   Virat   55      Punjab
1   Rohit   70      Mumbai

In [52]:
# in descending order
df.sort_values("Age", ascending=False)

     Name  Age        City
1   Rohit   70      Mumbai
0   Virat   55      Punjab
2  Ramesh   45  Chandigarh

## Accessing values

### Accessing rows by index

In [57]:
# row at 1st index
df.iloc[1]

Name     Rohit
Age         70
City    Mumbai
Name: 1, dtype: object

In [61]:
# row at 2nd index
df.iloc[2]

Name        Ramesh
Age             45
City    Chandigarh
Name: 2, dtype: object

### Accessing cols by colname

In [63]:
df['Age']

0    55
1    70
2    45
Name: Age, dtype: int64

In [64]:
df['Name']

0     Virat
1     Rohit
2    Ramesh
Name: Name, dtype: object

## Manipulation

### Removing columns

In [83]:
# deleting Age column
print(df)
df_new = df.drop('Age', axis=1)
print('==============================')
print(df_new)

     Name  Age        City
0   Virat   55      Punjab
1   Rohit   70      Mumbai
2  Ramesh   45  Chandigarh
==============================
     Name        City
0   Virat      Punjab
1   Rohit      Mumbai
2  Ramesh  Chandigarh

In [84]:
# deleting multiple columns
print(df)
df_new = df.drop(['Age', 'City'], axis=1)
print('==============================')
print(df_new)

     Name  Age        City
0   Virat   55      Punjab
1   Rohit   70      Mumbai
2  Ramesh   45  Chandigarh
==============================
     Name
0   Virat
1   Rohit
2  Ramesh

### Removing rows

In [85]:
# deleting last row (2nd index)
print(df)
df_new = df.drop(2, axis=0)
print('==============================')
print(df_new)

     Name  Age        City
0   Virat   55      Punjab
1   Rohit   70      Mumbai
2  Ramesh   45  Chandigarh
==============================
    Name  Age    City
0  Virat   55  Punjab
1  Rohit   70  Mumbai

In [86]:
# deleting multiple rows
print(df)
df_new = df.drop([1, 2], axis=0)
print('==============================')
print(df_new)

     Name  Age        City
0   Virat   55      Punjab
1   Rohit   70      Mumbai
2  Ramesh   45  Chandigarh
==============================
    Name  Age    City
0  Virat   55  Punjab

### Renaming Cols

### renaming one col

In [87]:
print(df)
df_new = df.rename(columns={'City': 'Location'})
print('==============================')
print(df_new)

     Name  Age        City
0   Virat   55      Punjab
1   Rohit   70      Mumbai
2  Ramesh   45  Chandigarh
==============================
     Name  Age    Location
0   Virat   55      Punjab
1   Rohit   70      Mumbai
2  Ramesh   45  Chandigarh

### renaming multiple rows

In [88]:
print(df)
df_new = df.rename(columns={'City': 'Location', 'Name': 'Alias'})
print('==============================')
print(df_new)

     Name  Age        City
0   Virat   55      Punjab
1   Rohit   70      Mumbai
2  Ramesh   45  Chandigarh
==============================
    Alias  Age    Location
0   Virat   55      Punjab
1   Rohit   70      Mumbai
2  Ramesh   45  Chandigarh

### Slicing data

In [94]:
# taking first two rows and column index 0
print(df)
print('==============================')
df.iloc[:2, 0]

     Name  Age        City
0   Virat   55      Punjab
1   Rohit   70      Mumbai
2  Ramesh   45  Chandigarh
==============================

0    Virat
1    Rohit
Name: Name, dtype: object

In [93]:
# taking first row and column index 2
print(df)
print('==============================')
print(df.iloc[1, 2])

     Name  Age        City
0   Virat   55      Punjab
1   Rohit   70      Mumbai
2  Ramesh   45  Chandigarh
==============================
Mumbai

In [96]:
# taking first row and column named Age
print(df)
print('==============================')
print(df.loc[1, 'Age'])

     Name  Age        City
0   Virat   55      Punjab
1   Rohit   70      Mumbai
2  Ramesh   45  Chandigarh
==============================
70